//@ts-ignore
import foto1 from '../img/Фото1.png';
//@ts-ignore
import foto2 from '../img/Фото2.png';
//@ts-ignore
import foto3 from '../img/Фото3.png';
//@ts-ignore
import foto4 from '../img/Фото4.png';
//@ts-ignore
import foto5 from '../img/Фото5.png';
//@ts-ignore
import foto6 from '../img/Фото6.png';


export const registers = [
    {
        id: '#1',
        name: `Система управления базами данных «Ред База Данных»`,
        kodName: `02.09`,
        klassProgramm: `Системы управления базами данных`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#2',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами организации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#3',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами организации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#4',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами организации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#5',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами организации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#6',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами организации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#7',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами рганизации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#8',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами организации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#9',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами организации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },
    {
        id: '#10',
        name: `1С:Школа. Информатика, 11 класс`,
        kodName: `04.11`,
        klassProgramm: `Системы управления процессами организации`,
        date: `29.01.2016`,
        reference: `Ссылка`
    },

]

export const newsData = [
    {
        img: foto1,
        header: 'Технические работы 30.05.2022',
        date: '30.05.2022',
        desc: 'В связи с проведением технических работ \n' +
            '30.05.2022 с 15:00 могут наблюдаться пер...'
    },
    {
        img: foto2,
        header: 'Изменение справочника',
        date: '28.05.2022',
        desc: 'Обращаем внимание, что с 28.05.2022 \n' +
            'внесены изменения в справочник "Дей...'
    },
    {
        img: foto3,
        header: 'Технические работы 26.05.2022',
        date: '26.05.2022',
        desc: 'В связи с проведением технических работ \n' +
            '26.05.2022 с 21:00 могут наблюдаться пер...'
    },
    {
        img: foto4,
        header: 'Лицензирование в Беларуси',
        date: '25.05.2022',
        desc: 'Лицензирование затрагивает отдельные \n' +
            'виды деятельности в Республике Беларус...'
    },
    {
        img: foto5,
        header: 'Тестирование системы новостей Ед...',
        date: '20.05.2022',
        desc: 'Тестирование системы новостей ЕРЛ.'
    },
    {
        img: foto6,
        header: 'Обновление версии реестра ПО',
        date: '18.05.2022',
        desc: 'В новой версии доступны новые функции,\n' +
            'которые упрощают использование сервис...'
    },

]

export const documentsData = [
    {
        type: 'Общие документы',
        name: `Постановление Правительства Российской 
Федерации от 20.07.2021 "О внесении 
изменений в постановление Правительства 
Российской Федерации от 16 ноября 2015 г. 
№ 1236"`,
        date: '20.07.2021',
        num: '1226',
        size: '469 Кб'
    },
    {
        type: 'Общие документы',
        name: `Приказ №486 от 22.09.2020 Об утверждении 
классификатора программ для электронных 
вычислительных машин и баз данных`,
        date: '22.09.2020',
        num: '468',
        size: '10.81 Мб'
    },
    {
        type: 'Общие документы',
        name: `Административный регламент ПРИКАЗ 
от 21 февраля 2019 года N62`,
        date: '21.02.2019',
        num: '62',
        size: '2.25 Мб'
    },
    {
        type: 'Общие документы',
        name: `Постановление Правительства РФ 
от 20.12.2017 № 1594 "О внесении изменений 
в постановление Правительства Российской 
Федерации от 16 ноября 2015 г. № 1236"`,
        date: '20.12.2017',
        num: '1594',
        size: '2.07 Мб'
    },
    {
        type: 'Общие документы',
        name: `Об утверждении правил применения 
классификатора программ для электронных 
вычислительных машин и баз данных`,
        date: '31.12.2015',
        num: '622',
        size: '4.69 Мб'
    },
]